nxp-mcuxpresso/mcux-devices-mcx/MCXW/MCXW235/iar/startup_MCXW235.s
        PUBWEAK PUF_IRQHandler
        PUBWEAK PUF_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
PUF_IRQHandler
        LDR     R0, =PUF_DriverIRQHandler
        BX      R0

        PUBWEAK TRNG_IRQHandler
        PUBWEAK TRNG_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
TRNG_IRQHandler
        LDR     R0, =TRNG_DriverIRQHandler
        BX      R0

        PUBWEAK DMA1_IRQHandler
        PUBWEAK DMA1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA1_IRQHandler
        LDR     R0, =DMA1_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved75_IRQHandler
        PUBWEAK Reserved75_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved75_IRQHandler
        LDR     R0, =Reserved75_DriverIRQHandler
        BX      R0

        PUBWEAK CDOG_IRQHandler
        PUBWEAK CDOG_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
CDOG_IRQHandler
        LDR     R0, =CDOG_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved77_IRQHandler
        PUBWEAK Reserved77_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved77_IRQHandler
        LDR     R0, =Reserved77_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved78_IRQHandler
        PUBWEAK Reserved78_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved78_IRQHandler
        LDR     R0, =Reserved78_DriverIRQHandler
        BX      R0

        PUBWEAK WAKE_PAD_IRQHandler
        PUBWEAK WAKE_PAD_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
WAKE_PAD_IRQHandler
        LDR     R0, =WAKE_PAD_DriverIRQHandler
        BX      R0

WDT_BOD_DriverIRQHandler
DMA0_DriverIRQHandler
GINT0_DriverIRQHandler
Reserved19_DriverIRQHandler
PIN_INT0_DriverIRQHandler
PIN_INT1_DriverIRQHandler
PIN_INT2_DriverIRQHandler
PIN_INT3_DriverIRQHandler
UTICK0_DriverIRQHandler
MRT0_DriverIRQHandler
CTIMER0_DriverIRQHandler
CTIMER1_DriverIRQHandler
SCT0_DriverIRQHandler
CTIMER3_DriverIRQHandler
FLEXCOMM0_DriverIRQHandler
FLEXCOMM1_DriverIRQHandler
FLEXCOMM2_DriverIRQHandler
Reserved33_DriverIRQHandler
Reserved34_DriverIRQHandler
Reserved35_DriverIRQHandler
Reserved36_DriverIRQHandler
Reserved37_DriverIRQHandler
BLE_LL_DriverIRQHandler
BLE_SLP_TMR_DriverIRQHandler
WDT_DriverIRQHandler
Reserved41_DriverIRQHandler
Reserved42_DriverIRQHandler
BOD1_DriverIRQHandler
BOD2_DriverIRQHandler
RTC_DriverIRQHandler
Reserved46_DriverIRQHandler
WAKE_DSLP_DriverIRQHandler
PIN_INT4_DriverIRQHandler
PIN_INT5_DriverIRQHandler
PIN_INT6_DriverIRQHandler
PIN_INT7_DriverIRQHandler
CTIMER2_DriverIRQHandler
CTIMER4_DriverIRQHandler
OS_EVENT_DriverIRQHandler
SPIFI_DriverIRQHandler
Reserved56_DriverIRQHandler
Reserved57_DriverIRQHandler
Reserved58_DriverIRQHandler
FLASH_CCIF_DriverIRQHandler
FLASH_DFIF_DriverIRQHandler
Reserved61_DriverIRQHandler
Reserved62_DriverIRQHandler
Reserved63_DriverIRQHandler
Reserved64_DriverIRQHandler
SEC_HYPERVISOR_CALL_DriverIRQHandler
SEC_GPIO_INT0_IRQ0_DriverIRQHandler
SEC_GPIO_INT0_IRQ1_DriverIRQHandler
PLU_DriverIRQHandler
SEC_VIO_DriverIRQHandler
HASHCRYPT_DriverIRQHandler
CASPER_DriverIRQHandler
PUF_DriverIRQHandler
TRNG_DriverIRQHandler
DMA1_DriverIRQHandler
Reserved75_DriverIRQHandler
CDOG_DriverIRQHandler
Reserved77_DriverIRQHandler
Reserved78_DriverIRQHandler
WAKE_PAD_DriverIRQHandler
DefaultISR
        B .

        END
